software-engineering-windows.org
#+title:     Why I Won't Use Windows
#+author:    Logan Barnett
#+email:     logustus@gmail.com
#+date:      <2021-04-14 Wed>
#+language:  en
#+file_tags:
#+tags:
#+toc:       headlines 5 local
#+auto_id:   t

I won't willingly use Windows - not for development work, or any real work if I
can help it.  I won't work at a workplace that requires its software engineers
to use Windows.  I actively recommend that people don't work at workplaces that
require their software engineers use Windows.  I will explain why.

* Disclaimers, Audience, etc
:PROPERTIES:
:CUSTOM_ID: disclaimers-audience-etc
:END:

** Objectiveness
:PROPERTIES:
:CUSTOM_ID: disclaimers-audience-etc--objectiveness
:END:

This article is going to be a little subjective.  Windows can literally do
everything I will outline by virtue of being able to run a virtual machine with
the OS that does the job.  But if we're talking about the virtues of an OS, what
it readily affords, and what you have to do in order to accomplish certain
tasks, saying your operating system can run another operating system (they all
can), isn't really saying anything useful.  At some point a line must be drawn
on what a thing is good at and bad at, and understand there will be edge cases.

This is not a hate document towards Microsoft or its Windows operating system.
I wish to deliver what I believe are articulated and well thought out reasons
for rejecting Windows.  I will provide more details on why I believe my
perspective here is more objective or at least more reasoned than a random
person exclaiming that they hate Windows, but only later.  Know that this is not
a venting document.

I have paid my bills with the .Net technology stack, and you can judge for
yourself the depth or how current that experience is by perusing my [[./resume.html][resume]].

** Articulation has Value
:PROPERTIES:
:CUSTOM_ID: disclaimers-audience-etc--articulation-has-value
:END:

I believe there is great value in being able to articulate oneself.  That is my
primary motivation for this document: I want a comprehensive and cohesive place
to organize my thoughts on the topic.  I'm sharing it because maybe you'll find
some points resonate with you, but also sharing requires I meet a certain level
of cohesiveness.  Weak arguments have no room in public light.

** You do You
:PROPERTIES:
:CUSTOM_ID: disclaimers-audience-etc--you-do-you
:END:

Keep using Windows.  Keep going to work at places that require Windows.  Do what
you like, this is not to convince you that you should do something different.  I
might've linked you here to convince you, but understand that this isn't a
general plea to the public that you should stop using Windows.

** Actually Using Windows
:PROPERTIES:
:CUSTOM_ID: disclaimers-audience-etc--actually-using-windows
:END:

+I _do_ use Windows, begrudgingly, because one of my vices is playing video
games.+  This has recently changed for me.  Using Steam's Proton integration
(which itself uses Wine) has really scratched the itch for me.  I used to need
Windows for games.  No longer.

