software-engineering-windows.html
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#disclaimers-audience-etc">1. Disclaimers, Audience, etc</a>
<ul>
<li><a href="#disclaimers-audience-etc--objectiveness">1.1. Objectiveness</a></li>
<li><a href="#disclaimers-audience-etc--articulation-has-value">1.2. Articulation has Value</a></li>
<li><a href="#disclaimers-audience-etc--you-do-you">1.3. You do You</a></li>
<li><a href="#disclaimers-audience-etc--actually-using-windows">1.4. Actually Using Windows</a></li>
</ul>
</li>
<li><a href="#a-history-with-microsoft">2. A History with Microsoft</a></li>
<li><a href="#technical-considerations">3. Technical Considerations</a>
<ul>
<li><a href="#technical-considerations--the-model-of-unix">3.1. The Model of Unix</a></li>
<li><a href="#technical-considerations--hostility-towards-software-development">3.2. Hostility towards Software Development</a></li>
</ul>
</li>
<li><a href="#career-considerations">4. Career Considerations</a>
<ul>
<li><a href="#career-considerations--how-others-view-your-career">4.1. How Others View Your Career</a></li>
<li><a href="#career-considerations--how-you-treat-your-own-career">4.2. How You Treat Your Own Career</a></li>
</ul>
</li>
<li><a href="#the-positive-encouragement-away">5. The Positive Encouragement Away</a></li>
<li><a href="#wrapping-up">6. Wrapping Up</a></li>
</ul>
</div>
<p>
I won&rsquo;t willingly use Windows - not for development work, or any real work if I
can help it.  I won&rsquo;t work at a workplace that requires its software engineers
to use Windows.  I actively recommend that people don&rsquo;t work at workplaces that
require their software engineers use Windows.  I will explain why.
</p>
<div id="outline-container-disclaimers-audience-etc" class="outline-2">
<h2 id="disclaimers-audience-etc"><span class="section-number-2">1.</span> Disclaimers, Audience, etc</h2>
<div class="outline-text-2" id="text-disclaimers-audience-etc">
</div>
<div id="outline-container-disclaimers-audience-etc--objectiveness" class="outline-3">
<h3 id="disclaimers-audience-etc--objectiveness"><span class="section-number-3">1.1.</span> Objectiveness</h3>
<div class="outline-text-3" id="text-disclaimers-audience-etc--objectiveness">
<p>
This article is going to be a little subjective.  Windows can literally do
everything I will outline by virtue of being able to run a virtual machine with
the OS that does the job.  But if we&rsquo;re talking about the virtues of an OS, what
it readily affords, and what you have to do in order to accomplish certain
tasks, saying your operating system can run another operating system (they all
can), isn&rsquo;t really saying anything useful.  At some point a line must be drawn
on what a thing is good at and bad at, and understand there will be edge cases.
</p>

<p>
This is not a hate document towards Microsoft or its Windows operating system.
I wish to deliver what I believe are articulated and well thought out reasons
for rejecting Windows.  I will provide more details on why I believe my
perspective here is more objective or at least more reasoned than a random
person exclaiming that they hate Windows, but only later.  Know that this is not
a venting document.
</p>

<p>
I have paid my bills with the .Net technology stack, and you can judge for
yourself the depth or how current that experience is by perusing my <a href="./resume.html">resume</a>.
</p>
</div>
</div>
<div id="outline-container-disclaimers-audience-etc--articulation-has-value" class="outline-3">
<h3 id="disclaimers-audience-etc--articulation-has-value"><span class="section-number-3">1.2.</span> Articulation has Value</h3>
<div class="outline-text-3" id="text-disclaimers-audience-etc--articulation-has-value">
<p>
I believe there is great value in being able to articulate oneself.  That is my
primary motivation for this document: I want a comprehensive and cohesive place
to organize my thoughts on the topic.  I&rsquo;m sharing it because maybe you&rsquo;ll find
some points resonate with you, but also sharing requires I meet a certain level
of cohesiveness.  Weak arguments have no room in public light.
</p>
</div>
</div>
<div id="outline-container-disclaimers-audience-etc--you-do-you" class="outline-3">
<h3 id="disclaimers-audience-etc--you-do-you"><span class="section-number-3">1.3.</span> You do You</h3>
<div class="outline-text-3" id="text-disclaimers-audience-etc--you-do-you">
<p>
Keep using Windows.  Keep going to work at places that require Windows.  Do what
you like, this is not to convince you that you should do something different.  I
might&rsquo;ve linked you here to convince you, but understand that this isn&rsquo;t a
general plea to the public that you should stop using Windows.
</p>
</div>
</div>
<div id="outline-container-disclaimers-audience-etc--actually-using-windows" class="outline-3">
<h3 id="disclaimers-audience-etc--actually-using-windows"><span class="section-number-3">1.4.</span> Actually Using Windows</h3>
<div class="outline-text-3" id="text-disclaimers-audience-etc--actually-using-windows">
<p>
<del>I <span class="underline">do</span> use Windows, begrudgingly, because one of my vices is playing video
games.</del>  This has recently changed for me.  Using Steam&rsquo;s Proton integration
(which itself uses Wine) has really scratched the itch for me.  I used to need
Windows for games.  No longer.
</p>
</div>
</div>
</div>
