software-engineering-windows.html
<div id="outline-container-a-history-with-microsoft" class="outline-2">
<h2 id="a-history-with-microsoft"><span class="section-number-2">2.</span> A History with Microsoft</h2>
<div class="outline-text-2" id="text-a-history-with-microsoft">
<p>
I know Microsoft wants to do better - to embrace open source and get onto a more
accessible model.  Microsoft highly values the throng of users stuck on older
versions of the software, and people slow to change.  It&rsquo;s their base, so it
makes sense for them to do so.
</p>

<p>
My wariness comes from a history where I have observed a pattern.
</p>

<p>
Microsoft attempts some really interesting and exciting things.  Here&rsquo;s a
sampling:
</p>

<ul class="org-ul">
<li>Using the XBox One, Microsoft made a sincere attempt at creating a successful
version of the Steambox.  Steam has pushed hard for a Steambox - a Linux based
gaming platform.  They&rsquo;ve gotten many video games to support &ldquo;Steam Play&rdquo;,
which is their sticker of approval saying the game runs on Linux, macOS, and
Windows.  The idea differs from one of exchanging media discs which eventually
wear out or break, and require book-case like representation in a media room
for storage.  Instead it favors downloading the game directly onto the
device&rsquo;s storage, where loading times will be much faster and you needn&rsquo;t
worry about how someone smudges your precious copy of Halo in the act of
putting it back in its case.  The distribution model has worked great for
Steam, though Steam didn&rsquo;t seem to hit the mark very well with the Steambox.</li>
<li>OData existed before GraphQL.  It was kind of an attempt at standardizing the
REST &#x2026;protocol? which even today remains to be a kind of zone of
lawlessness.  REST is generally considered to be a good thing, but it is
incomplete.  This is why every language has an &ldquo;API&rdquo; for various popular
RESTful APIs.  We all kind of understand it but we can&rsquo;t easily get away with
a universal &ldquo;REST consumer&rdquo; because the nature of REST is such a thing cannot
exist.  OData provided a very standardized means of programmatic discovery for
a REST API, as well as a standardized query mechanism for getting data.</li>
<li>The Surface tablet suggested a rise of touch screen laptops and so with their
shiny new hardware Microsoft set out to embrace this predicted market trend
with Windows 8&rsquo;s tiles and charms.  This is Windows&rsquo; new way of embracing a
touch interface, where the interface favors a series of controls on the left
and right of the screen (where your thumbs would go, if you were grasping a
large touch-screen laptop).</li>
<li>The Holo Lens is an augmented reality (AR) headset, providing a wide spectrum
of view.  Put these glasses on, and the software provides a visual overlay on
top of what you&rsquo;re seeing in the outside world.  You could potentially see
your bus approaching your stop even though buildings obstructed your view.
You could discover points of interest that are normally very difficult to find
due to the layout of streets and buildings, or even find people in a crowded
social event.  AR has a lot of potential for many more use cases, and the Holo
Lens is perhaps the first serious attempt at embracing it.</li>
<li>.Net came out a while ago, but I&rsquo;m old enough to remember the announcement.
It had the promise of a much better iteration of Java.  The language would be
better, and just like Java, it would be cross platform, and many languages
would compile down to a common byte code.</li>
<li>Microsoft developed Powershell, a retake on the shells of old.  Shells like
<code>bash</code> would hold no candle to Powershell, whose model of information was
&ldquo;objects&rdquo; or perhaps better thought of as records.  This would mean you
wouldn&rsquo;t need to do text chopping as is done <code>bash</code> to do something like
select a column of data.  It would be a far improvement over Microsoft&rsquo;s own
<code>batch</code>.</li>
</ul>

<p>
Interesting things, yeah? So here&rsquo;s where <span class="underline">they hurt me</span>, or at least
demonstrated a pattern that keeps me unwilling to give additional chances:
</p>

<ul class="org-ul">
<li>The XBox One backed away from using their online store, very late in the game.
This was done in response to a Sony Playstation video showing how easy it is
to loan one game to a friend.  This is an inherent trade-off of the
download-only model.  It&rsquo;s a bold vision to pursue but Microsoft didn&rsquo;t stick
their guns.  They went back to the prior disc model, and so console video
games remain as they have since the advent of old Commodore 64 cartridges: You
must have some detachable media to play games.  That media is prone to faults
and losing that media means you&rsquo;ve lost your investment.</li>
<li>OData allowed arbitrary <code>POST</code> actions for times when REST didn&rsquo;t seem to do
the trick.  In that way OData became a slave to two masters.  Having software
try to do more than one thing is often a mortal wound.  That was its death to
me.  I don&rsquo;t know if it fell into neglect or if these accommodations had
similar impact on others.  In any case, giants like Netflix who were using
OData stopped using OData.  Nowadays if you want the promised benefits of
OData, you reach for GraphQL, which seems to be on the rise based on my wet
finger raised to the winds.</li>
<li>Windows 8 really riled some feathers.  The tile stuff didn&rsquo;t make sense to
non-touch-screen laptops, and not everyone went out an bought a new laptop
(let alone a touch screen laptop) to jump into the new hotness of Windows 8.
Windows 8 didn&rsquo;t seem to intelligently understand it was running on a touch
screen device, and so it really got a lot of backlash.  Windows 8.1 hid the
tiles as an opt-in feature.  We still see some remnants of it in modern
iterations of Windows&rsquo; new UIs, but with nobody designing their applications
with it in mind, it might as well be vestigial.</li>
<li>The Holo Lens came out of the prototype phase with an incredibly limited field
of view.  Discovering information by sweeping your vision would be more like
scanning crowded streets through a keyhole (a bit of an exaggeration, but the
point stands).</li>
<li>.Net did fulfill its promise of being cross language, and it did pull people
over from Visual Basic.  However everyone just uses C#.  Not even Unity could
get people to use UnityScript for anything serious - today C# and .Net are
fairly synonymous in terms of usage.  If you&rsquo;re doing things with .Net, you&rsquo;re
using C# to do it.  C# isn&rsquo;t bad as object oriented languages go, but cross
language usage is a vestigial feature now.  Perhaps it could be considered a
net win still: Java has taken strides to support other languages in its byte
code (mimicry is flattery) and pulling away VB6 programmers into the C# world
is generally considered to be a good thing.  A more definite disappointment
was .Net&rsquo;s cross platform support.  Cross platform in this case simply meant
&ldquo;It runs on all versions of Windows&rdquo; - not exactly what I had in mind.  A
rogue project called Mono, tied up with the now-dead Novell, made an
implementation that ran on other platforms.  Over a decade later the
implementation was eventually subsumed into official .Net land.  But generally
if you&rsquo;re doing .Net you&rsquo;re doing Windows, with C#.</li>
<li>Powershell was released as part of the Windows operating system, disabled by
default, and requiring some complicated and scary operations to run.  This
immensely hurts Powershell as it means scripting authors can&rsquo;t rely on it
being enabled.  It increases the barrier to entry to folks who are less risk
adverse or people who are virtually already system administrators for Windows
itself.</li>
</ul>

<p>
To me all of this points to a horse that oftentimes gets to the finish line
before any other horse, but seems to always do some kind of face plant right
before it crosses.  I don&rsquo;t see this as a platform of stability, or one that
enables me to flourish as someone who want the computer to work for me instead
of me working for the computer.
</p>
</div>
</div>
