software-engineering-windows.org
* Technical Considerations
:PROPERTIES:
:CUSTOM_ID: technical-considerations
:END:
** The Model of Unix
:PROPERTIES:
:CUSTOM_ID: technical-considerations--the-model-of-unix
:END:

Or POSIX, or Linux, or *nix, or whatever we need to call it.

A good model is worth its weight in =$precious_metal=, and has been proven in
the software industry to make that software keep going for [[https://en.wikipedia.org/wiki/Unix#History][half a century or
more]].  One such model in this ecosystem which will be covered is how
[[https://en.wikipedia.org/wiki/Everything_is_a_file][everything is a file]].  Let's dive into this for a moment.

In POSIX, everything is a file.  Generally we think of files as blobs of data,
and we can use programs to view or manipulate those files.  However the model of
"everything is a file" goes deeper than that.  Files in POSIX are better
described as a named entity in which you can read from and write to - and that's
about it.  That could map to some location in storage like we traditionally
think about it, but it also can include hardware (disks, serial ports, network
ports, even CPUs or displays).

Files can also be the processes themselves.  Think about the meaning of that: If
you can write to a file, and a file can be a process, that means you can write
to a process.  What does that mean? That means I can communicate with a process
by sending it data through a well-known mechanism (file writing).  I don't need
some special API to make this happen - it's a notion built into the model of the
entire operating system.  Every process has a =stdin= and =stdout= which are
inputs and outputs.  We can write to a processes' input as well as read from its
output.  This allows us to compose lots of small programs together to achieve
powerful effects.  The composition mechanism is well understood and incredibly
flexible.  It doesn't demand bespoke mechanisms that an unstandardized model
would bring about.

Windows has some mechanisms that kind of mimic the composition seen in POSIX.
These piped redirections will allow you to do some amount of composition, but
the fact that devices are not also files that you can simply read/write, much of
it is lost.

Of course, the file model seen in POSIX isn't the only model it uses.  There are
others, but I have not observed Windows using these.  Generally developing
software on Windows requires monolithic software constructs.  APIs rule that
landscape.  I don't want APIs - they are contrary to composition.

** Hostility towards Software Development
:PROPERTIES:
:CUSTOM_ID: technical-considerations--hostility-towards-software-development
:END:

Windows is actively hostile to software development, and this is quick and easy
to prove.  In Windows, the only out-of-box scripting you can do is with =cmd=,
and JavaScript you load with Microsoft Edge.  Granted, you can start installing
things to achieve more.  However, these programs have their limits.  Most parts
of Windows are governed by DLLs or other programs.  These entities require APIs
to access.  Compare this to Linux and macOS, where virtually every setting is
governed by a text file somewhere.

Since the advent of Powershell, Microsoft has been pushing for more command line
tools to access things.  This is a mistake (though not exclusively Microsoft's):
Requiring programs to change things is, once again, introducing bespoke APIs.
Learning how to edit one program's settings doesn't position you to be any
better at editing another program's settings.  Whereas learning to manipulate
text carries over to every other text file.

Every time you click on something, an automation fairy dies.  The mouse is not
an easily automated device.  Programs in Windows are generally built with a GUI
first, which means the ability automate them is an afterthought.  The GUI is a
curated experience over the data it operates upon - your data.  Without tooling
to use the programs as you see fit (instead the tooling keeps you in a sort of
prison), you are unable to compose programs together.  You cannot make one
program's usefulness easily extend to another's.  Instead the program must
directly support the functionality you desire.  This keeps you beholden to that
program's feature support.  This is not how you have software that endures the
ages, and it hinders your ability automate (thus script), which is a core
capability of software development.

** COMMENT Windows Resists my Mad Scientist Career Goal
:PROPERTIES:
:CUSTOM_ID: technical-considerations--windows-resists-my-mad-scientist-career-goal
:END:

I commented this because it overlaps too much with the subject above.

It's a well known fact that mad scientists just don't have time to do everything
themselves.  They need an Egor.  Keeping around an actual Egor that you don't
pay is unethical, so instead a good mad scientist will enlist their computer.
In order for computers to do meaningful work for every function they perform,
there must be an interface for it.

* Career Considerations
:PROPERTIES:
:CUSTOM_ID: career-considerations
:END:

** How Others View Your Career
:PROPERTIES:
:CUSTOM_ID: career-considerations--how-others-view-your-career
:END:

Much in the same way that I have steered away budding software engineers from
PHP because of the [[https://eev.ee/blog/2012/04/09/php-a-fractal-of-bad-design/][systemically broken nature of it]], I steer away those same
engineers from working at Windows based workplaces.  The [[Technical
Considerations]] builds why I think Windows is individually a bad choice.

When I interview a candidate and I see you've been spending time in a Windows
workplace, it will guide many of my interview questions.  It's a smell or red
flag, not an automatic deal breaker for me (although it may be for some).  I
will craft questions that tease out the candidate's ability to automate things,
and when they automated things, how they went about it.  I want to confirm my
suspicion: Their muscle for automation has atrophied, or was never there.

The same can be said for their ability model things - a highly sought after
skill for a software engineer.  If the candidate can't even appreciate a good
model such as "everything is a file", then that candidate is going to struggle
with my models which I try to keep in a similar principle.

Clearly I paint with broad stokes here.  Will I encounter PHP and Windows
engineers who surprise me? I'm sure I will.  However I don't consider the
numbers to be in their favor for any given engineer to be that person.  With new
candidates comes a lot of guesswork and extrapolation - a very imperfect
process.  But I must use _something_.

