software-engineering-windows.html
<div id="outline-container-technical-considerations" class="outline-2">
<h2 id="technical-considerations"><span class="section-number-2">3.</span> Technical Considerations</h2>
<div class="outline-text-2" id="text-technical-considerations">
</div>
<div id="outline-container-technical-considerations--the-model-of-unix" class="outline-3">
<h3 id="technical-considerations--the-model-of-unix"><span class="section-number-3">3.1.</span> The Model of Unix</h3>
<div class="outline-text-3" id="text-technical-considerations--the-model-of-unix">
<p>
Or POSIX, or Linux, or *nix, or whatever we need to call it.
</p>

<p>
A good model is worth its weight in <code>$precious_metal</code>, and has been proven in
the software industry to make that software keep going for <a href="https://en.wikipedia.org/wiki/Unix#History">half a century or
more</a>.  One such model in this ecosystem which will be covered is how
<a href="https://en.wikipedia.org/wiki/Everything_is_a_file">everything is a file</a>.  Let&rsquo;s dive into this for a moment.
</p>

<p>
In POSIX, everything is a file.  Generally we think of files as blobs of data,
and we can use programs to view or manipulate those files.  However the model of
&ldquo;everything is a file&rdquo; goes deeper than that.  Files in POSIX are better
described as a named entity in which you can read from and write to - and that&rsquo;s
about it.  That could map to some location in storage like we traditionally
think about it, but it also can include hardware (disks, serial ports, network
ports, even CPUs or displays).
</p>

<p>
Files can also be the processes themselves.  Think about the meaning of that: If
you can write to a file, and a file can be a process, that means you can write
to a process.  What does that mean? That means I can communicate with a process
by sending it data through a well-known mechanism (file writing).  I don&rsquo;t need
some special API to make this happen - it&rsquo;s a notion built into the model of the
entire operating system.  Every process has a <code>stdin</code> and <code>stdout</code> which are
inputs and outputs.  We can write to a processes&rsquo; input as well as read from its
output.  This allows us to compose lots of small programs together to achieve
powerful effects.  The composition mechanism is well understood and incredibly
flexible.  It doesn&rsquo;t demand bespoke mechanisms that an unstandardized model
would bring about.
</p>

<p>
Windows has some mechanisms that kind of mimic the composition seen in POSIX.
These piped redirections will allow you to do some amount of composition, but
the fact that devices are not also files that you can simply read/write, much of
it is lost.
</p>

<p>
Of course, the file model seen in POSIX isn&rsquo;t the only model it uses.  There are
others, but I have not observed Windows using these.  Generally developing
software on Windows requires monolithic software constructs.  APIs rule that
landscape.  I don&rsquo;t want APIs - they are contrary to composition.
</p>
</div>
</div>
<div id="outline-container-technical-considerations--hostility-towards-software-development" class="outline-3">
<h3 id="technical-considerations--hostility-towards-software-development"><span class="section-number-3">3.2.</span> Hostility towards Software Development</h3>
<div class="outline-text-3" id="text-technical-considerations--hostility-towards-software-development">
<p>
Windows is actively hostile to software development, and this is quick and easy
to prove.  In Windows, the only out-of-box scripting you can do is with <code>cmd</code>,
and JavaScript you load with Microsoft Edge.  Granted, you can start installing
things to achieve more.  However, these programs have their limits.  Most parts
of Windows are governed by DLLs or other programs.  These entities require APIs
to access.  Compare this to Linux and macOS, where virtually every setting is
governed by a text file somewhere.
</p>

<p>
Since the advent of Powershell, Microsoft has been pushing for more command line
tools to access things.  This is a mistake (though not exclusively Microsoft&rsquo;s):
Requiring programs to change things is, once again, introducing bespoke APIs.
Learning how to edit one program&rsquo;s settings doesn&rsquo;t position you to be any
better at editing another program&rsquo;s settings.  Whereas learning to manipulate
text carries over to every other text file.
</p>

<p>
Every time you click on something, an automation fairy dies.  The mouse is not
an easily automated device.  Programs in Windows are generally built with a GUI
first, which means the ability automate them is an afterthought.  The GUI is a
curated experience over the data it operates upon - your data.  Without tooling
to use the programs as you see fit (instead the tooling keeps you in a sort of
prison), you are unable to compose programs together.  You cannot make one
program&rsquo;s usefulness easily extend to another&rsquo;s.  Instead the program must
directly support the functionality you desire.  This keeps you beholden to that
program&rsquo;s feature support.  This is not how you have software that endures the
ages, and it hinders your ability automate (thus script), which is a core
capability of software development.
</p>
</div>
</div>
</div>
<div id="outline-container-career-considerations" class="outline-2">
<h2 id="career-considerations"><span class="section-number-2">4.</span> Career Considerations</h2>
<div class="outline-text-2" id="text-career-considerations">
</div>
<div id="outline-container-career-considerations--how-others-view-your-career" class="outline-3">
<h3 id="career-considerations--how-others-view-your-career"><span class="section-number-3">4.1.</span> How Others View Your Career</h3>
<div class="outline-text-3" id="text-career-considerations--how-others-view-your-career">
<p>
Much in the same way that I have steered away budding software engineers from
PHP because of the <a href="https://eev.ee/blog/2012/04/09/php-a-fractal-of-bad-design/">systemically broken nature of it</a>, I steer away those same
engineers from working at Windows based workplaces.  The <a href="#technical-considerations">3</a> builds why I think Windows is individually a bad choice.
</p>

<p>
When I interview a candidate and I see you&rsquo;ve been spending time in a Windows
workplace, it will guide many of my interview questions.  It&rsquo;s a smell or red
flag, not an automatic deal breaker for me (although it may be for some).  I
will craft questions that tease out the candidate&rsquo;s ability to automate things,
and when they automated things, how they went about it.  I want to confirm my
suspicion: Their muscle for automation has atrophied, or was never there.
</p>

<p>
The same can be said for their ability model things - a highly sought after
skill for a software engineer.  If the candidate can&rsquo;t even appreciate a good
model such as &ldquo;everything is a file&rdquo;, then that candidate is going to struggle
with my models which I try to keep in a similar principle.
</p>

<p>
Clearly I paint with broad stokes here.  Will I encounter PHP and Windows
engineers who surprise me? I&rsquo;m sure I will.  However I don&rsquo;t consider the
numbers to be in their favor for any given engineer to be that person.  With new
candidates comes a lot of guesswork and extrapolation - a very imperfect
process.  But I must use <span class="underline">something</span>.
</p>
</div>
</div>
