software-engineering-windows.org
** How You Treat Your Own Career
:PROPERTIES:
:CUSTOM_ID: career-considerations--how-you-treat-your-own-career
:END:

Arguably there are infinite things to learn.  However we have infinite time to
learn them, and while we shouldn't use that as an excuse to learn things, we
should use it as an means to decide which things to learn.  Sure, you could
straddle the Unix and Windows worlds.  But why not learn Lambda Calculus?
Category Theory? New, shiny languages? [[https://aws.amazon.com/][Fad server hosting]]? Or even just go
deeper into Unix tools (you'll find the subject blossoms nicely).  For each year
you spend mastering Windows tech, you could've also spent mastering some other
tech.

Impostor syndrome runs rampant in our industry.  You may think that a Windows
shop is the only place that will accept you.  I want to stress that the
interview process is highly arbitrary and lacks a standard.  Biases run
unchecked in this setting.  Unix based shops aren't turning you down because you
have failed - the number of reasons in which an applicant is turned down are
many.  Sometimes another person is seen as a better fit than you.  They might
not feel like they are capable of handling someone at your experience level (in
which case you lucked out).  Maybe you didn't fit some norm they have.  "They
are the only ones that would hire me" just rings false.

* The Positive Encouragement Away
:PROPERTIES:
:CUSTOM_ID: the-positive-encouragement-away
:END:

While I haven't written it yet, I do plan on adding some articles on other
operating systems.  While this article is about not embracing Microsoft's
operating system, there are things it lacks that other operating systems have,
but aren't an exclusive lacking on Microsoft's side.

* Wrapping Up
:PROPERTIES:
:CUSTOM_ID: wrapping-up
:END:

More than a paper with statistics and facts, all I have presented is an
Aristotelian argument.  Perhaps this will help embolden your career decisions,
or even attack my position.  Feel free to dissect and reference this material
with my blessing.
