software-engineering-windows.html
<div id="outline-container-career-considerations--how-you-treat-your-own-career" class="outline-3">
<h3 id="career-considerations--how-you-treat-your-own-career"><span class="section-number-3">4.2.</span> How You Treat Your Own Career</h3>
<div class="outline-text-3" id="text-career-considerations--how-you-treat-your-own-career">
<p>
Arguably there are infinite things to learn.  However we have infinite time to
learn them, and while we shouldn&rsquo;t use that as an excuse to learn things, we
should use it as an means to decide which things to learn.  Sure, you could
straddle the Unix and Windows worlds.  But why not learn Lambda Calculus?
Category Theory? New, shiny languages? <a href="https://aws.amazon.com/">Fad server hosting</a>? Or even just go
deeper into Unix tools (you&rsquo;ll find the subject blossoms nicely).  For each year
you spend mastering Windows tech, you could&rsquo;ve also spent mastering some other
tech.
</p>

<p>
Impostor syndrome runs rampant in our industry.  You may think that a Windows
shop is the only place that will accept you.  I want to stress that the
interview process is highly arbitrary and lacks a standard.  Biases run
unchecked in this setting.  Unix based shops aren&rsquo;t turning you down because you
have failed - the number of reasons in which an applicant is turned down are
many.  Sometimes another person is seen as a better fit than you.  They might
not feel like they are capable of handling someone at your experience level (in
which case you lucked out).  Maybe you didn&rsquo;t fit some norm they have.  &ldquo;They
are the only ones that would hire me&rdquo; just rings false.
</p>
</div>
</div>
</div>
<div id="outline-container-the-positive-encouragement-away" class="outline-2">
<h2 id="the-positive-encouragement-away"><span class="section-number-2">5.</span> The Positive Encouragement Away</h2>
<div class="outline-text-2" id="text-the-positive-encouragement-away">
<p>
While I haven&rsquo;t written it yet, I do plan on adding some articles on other
operating systems.  While this article is about not embracing Microsoft&rsquo;s
operating system, there are things it lacks that other operating systems have,
but aren&rsquo;t an exclusive lacking on Microsoft&rsquo;s side.
</p>
</div>
</div>
<div id="outline-container-wrapping-up" class="outline-2">
<h2 id="wrapping-up"><span class="section-number-2">6.</span> Wrapping Up</h2>
<div class="outline-text-2" id="text-wrapping-up">
<p>
More than a paper with statistics and facts, all I have presented is an
Aristotelian argument.  Perhaps this will help embolden your career decisions,
or even attack my position.  Feel free to dissect and reference this material
with my blessing.
</p>
</div>
</div>
